In [1]:
import pandas as pd
import numpy as np

In [12]:
# creating 2 Pandas Series
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([6, 7, 8, 9, 10])
print(ser1)
print(ser2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [14]:
#Addition Of two series
add=ser1+ser2
add

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [15]:
#subtracting  Of two series
sub= ser1-ser2
sub

0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [16]:
# multiplying the 2 Series
mul = ser1*ser2
mul

0     6
1    14
2    24
3    36
4    50
dtype: int64

In [17]:
# dividing the 2 Series
div = ser1/ser2
div

0    0.166667
1    0.285714
2    0.375000
3    0.444444
4    0.500000
dtype: float64

In [19]:
df2=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["Kim","Susan","Tim","Tom"])
df2

              A         B         C
Kim   -0.655486  0.447227  1.196799
Susan -1.158572 -0.891916 -0.155151
Tim   -1.010702  0.423283 -0.839341
Tom    0.909055  0.414141  0.986878

In [21]:
#np.abs() - returb element-wise absoulate values of the input array
np.abs(df2)

              A         B         C
Kim    0.655486  0.447227  1.196799
Susan  1.158572  0.891916  0.155151
Tim    1.010702  0.423283  0.839341
Tom    0.909055  0.414141  0.986878

In [24]:
f=lambda x:x.max()-x.min()
df2.apply(f)

A    2.067626
B    1.339143
C    2.036139
dtype: float64